Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA106.h
#define _AD1CSSL_CSSL8_POSITION                  0x00000008
#define _AD1CSSL_CSSL8_MASK                      0x00000100
#define _AD1CSSL_CSSL8_LENGTH                    0x00000001

#define _AD1CSSL_CSSL9_POSITION                  0x00000009
#define _AD1CSSL_CSSL9_MASK                      0x00000200
#define _AD1CSSL_CSSL9_LENGTH                    0x00000001

#define _AD1CSSL_CSSL10_POSITION                 0x0000000A
#define _AD1CSSL_CSSL10_MASK                     0x00000400
#define _AD1CSSL_CSSL10_LENGTH                   0x00000001

#define _AD1CSSL_CSSL11_POSITION                 0x0000000B
#define _AD1CSSL_CSSL11_MASK                     0x00000800
#define _AD1CSSL_CSSL11_LENGTH                   0x00000001

#define _AD1CSSL_CSSL12_POSITION                 0x0000000C
#define _AD1CSSL_CSSL12_MASK                     0x00001000
#define _AD1CSSL_CSSL12_LENGTH                   0x00000001

#define _AD1CSSL_CSSL13_POSITION                 0x0000000D
#define _AD1CSSL_CSSL13_MASK                     0x00002000
#define _AD1CSSL_CSSL13_LENGTH                   0x00000001

#define _AD1CSSL_CSSL14_POSITION                 0x0000000E
#define _AD1CSSL_CSSL14_MASK                     0x00004000
#define _AD1CSSL_CSSL14_LENGTH                   0x00000001

#define _AD1CSSL_CSSL15_POSITION                 0x0000000F
#define _AD1CSSL_CSSL15_MASK                     0x00008000
#define _AD1CSSL_CSSL15_LENGTH                   0x00000001

#define _AD1CSSH_CSSH0_POSITION                  0x00000000
#define _AD1CSSH_CSSH0_MASK                      0x00000001
#define _AD1CSSH_CSSH0_LENGTH                    0x00000001

#define _AD1CSSH_CSSH1_POSITION                  0x00000001
#define _AD1CSSH_CSSH1_MASK                      0x00000002
#define _AD1CSSH_CSSH1_LENGTH                    0x00000001

#define _CTMUCON_EDG1STAT_POSITION               0x00000000
#define _CTMUCON_EDG1STAT_MASK                   0x00000001
#define _CTMUCON_EDG1STAT_LENGTH                 0x00000001

#define _CTMUCON_EDG2STAT_POSITION               0x00000001
#define _CTMUCON_EDG2STAT_MASK                   0x00000002
#define _CTMUCON_EDG2STAT_LENGTH                 0x00000001

#define _CTMUCON_EDG1SEL_POSITION                0x00000002
#define _CTMUCON_EDG1SEL_MASK                    0x0000000C
#define _CTMUCON_EDG1SEL_LENGTH                  0x00000002

#define _CTMUCON_EDG1POL_POSITION                0x00000004
#define _CTMUCON_EDG1POL_MASK                    0x00000010
#define _CTMUCON_EDG1POL_LENGTH                  0x00000001

#define _CTMUCON_EDG2SEL_POSITION                0x00000005
#define _CTMUCON_EDG2SEL_MASK                    0x00000060
#define _CTMUCON_EDG2SEL_LENGTH                  0x00000002

#define _CTMUCON_EDG2POL_POSITION                0x00000007
#define _CTMUCON_EDG2POL_MASK                    0x00000080
#define _CTMUCON_EDG2POL_LENGTH                  0x00000001

#define _CTMUCON_CTTRIG_POSITION                 0x00000008
#define _CTMUCON_CTTRIG_MASK                     0x00000100
#define _CTMUCON_CTTRIG_LENGTH                   0x00000001

#define _CTMUCON_IDISSEN_POSITION                0x00000009
#define _CTMUCON_IDISSEN_MASK                    0x00000200
#define _CTMUCON_IDISSEN_LENGTH                  0x00000001

#define _CTMUCON_EDGSEQEN_POSITION               0x0000000A
#define _CTMUCON_EDGSEQEN_MASK                   0x00000400
#define _CTMUCON_EDGSEQEN_LENGTH                 0x00000001

#define _CTMUCON_EDGEN_POSITION                  0x0000000B
#define _CTMUCON_EDGEN_MASK                      0x00000800
#define _CTMUCON_EDGEN_LENGTH                    0x00000001

#define _CTMUCON_TGEN_POSITION                   0x0000000C
#define _CTMUCON_TGEN_MASK                       0x00001000
#define _CTMUCON_TGEN_LENGTH                     0x00000001

#define _CTMUCON_CTMUSIDL_POSITION               0x0000000D
#define _CTMUCON_CTMUSIDL_MASK                   0x00002000
#define _CTMUCON_CTMUSIDL_LENGTH                 0x00000001

#define _CTMUCON_CTMUEN_POSITION                 0x0000000F
#define _CTMUCON_CTMUEN_MASK                     0x00008000
#define _CTMUCON_CTMUEN_LENGTH                   0x00000001

#define _CTMUCON_EDG1SEL0_POSITION               0x00000002
#define _CTMUCON_EDG1SEL0_MASK                   0x00000004
#define _CTMUCON_EDG1SEL0_LENGTH                 0x00000001

#define _CTMUCON_EDG1SEL1_POSITION               0x00000003
#define _CTMUCON_EDG1SEL1_MASK                   0x00000008
#define _CTMUCON_EDG1SEL1_LENGTH                 0x00000001

#define _CTMUCON_EDG2SEL0_POSITION               0x00000005
#define _CTMUCON_EDG2SEL0_MASK                   0x00000020
#define _CTMUCON_EDG2SEL0_LENGTH                 0x00000001

#define _CTMUCON_EDG2SEL1_POSITION               0x00000006
#define _CTMUCON_EDG2SEL1_MASK                   0x00000040
#define _CTMUCON_EDG2SEL1_LENGTH                 0x00000001

#define _CTMUICON_IRNG_POSITION                  0x00000008
#define _CTMUICON_IRNG_MASK                      0x00000300
#define _CTMUICON_IRNG_LENGTH                    0x00000002

#define _CTMUICON_ITRIM_POSITION                 0x0000000A
#define _CTMUICON_ITRIM_MASK                     0x0000FC00
#define _CTMUICON_ITRIM_LENGTH                   0x00000006

#define _CTMUICON_IRNG0_POSITION                 0x00000008
#define _CTMUICON_IRNG0_MASK                     0x00000100
#define _CTMUICON_IRNG0_LENGTH                   0x00000001

#define _CTMUICON_IRNG1_POSITION                 0x00000009
#define _CTMUICON_IRNG1_MASK                     0x00000200
#define _CTMUICON_IRNG1_LENGTH                   0x00000001

#define _CTMUICON_ITRIM0_POSITION                0x0000000A
#define _CTMUICON_ITRIM0_MASK                    0x00000400
#define _CTMUICON_ITRIM0_LENGTH                  0x00000001

#define _CTMUICON_ITRIM1_POSITION                0x0000000B
#define _CTMUICON_ITRIM1_MASK                    0x00000800
#define _CTMUICON_ITRIM1_LENGTH                  0x00000001

#define _CTMUICON_ITRIM2_POSITION                0x0000000C
#define _CTMUICON_ITRIM2_MASK                    0x00001000
#define _CTMUICON_ITRIM2_LENGTH                  0x00000001

#define _CTMUICON_ITRIM3_POSITION                0x0000000D
#define _CTMUICON_ITRIM3_MASK                    0x00002000
#define _CTMUICON_ITRIM3_LENGTH                  0x00000001

#define _CTMUICON_ITRIM4_POSITION                0x0000000E
#define _CTMUICON_ITRIM4_MASK                    0x00004000
#define _CTMUICON_ITRIM4_LENGTH                  0x00000001

#define _CTMUICON_ITRIM5_POSITION                0x0000000F
#define _CTMUICON_ITRIM5_MASK                    0x00008000
#define _CTMUICON_ITRIM5_LENGTH                  0x00000001

